src/toir_cfe/src/InformationRegisters/торо_АктуальныеПлановыеДатыРемонтов/торо_АктуальныеПлановыеДатыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="09bf821b-96d8-44ff-a873-1aa963572a34">
  <name>торо_АктуальныеПлановыеДатыРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="72058171-1407-4dd6-aab0-0f72afd60d2a">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="168c85e9-3bb0-431a-ae6e-08c455b37fa5">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="87dab202-5f73-4752-a87e-e69c7a5c70e7">
    <name>КрайняяДатаЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="9f5d4e4f-bee5-4929-ac3d-e4200cf1416f">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a6306ae3-4e8a-4225-8afa-a01e16f34954">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ee4238f-830b-4334-9861-1394de9ae423">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="85c92d14-1c04-44bd-9284-befe63c7394c">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="605b0bf5-59d2-473b-b6f9-85ceca4cd110">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/InformationRegisters/торо_ОбщиеДанныеПоРемонтам/торо_ОбщиеДанныеПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1b8fbeca-59ee-4207-b4da-c1fdb926cf07">
  <name>торо_ОбщиеДанныеПоРемонтам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="ca7de41a-4380-42d3-b93b-3d14a13ce3d9">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a534769e-5beb-4b57-b3af-d138e38afe8e">
    <name>ЕстьЗаявка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e320ae57-9da9-47dd-9d22-4265d1574beb">
    <name>ЕстьНаряд</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="26632482-bdd2-4881-af87-d856096d8d30">
    <name>ЕстьАкт</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="d55a38b3-ccd6-42d5-ae8f-6fe7a5e3b7e3">
    <name>ЕстьАктПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f7d027da-099e-47c1-b6c6-76397094ed0e">
    <name>Отменен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="646d6d26-3edf-4e80-88ae-f94e1a83e51d">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="760d81bf-833c-42a4-8d1e-f2df012d64e5">
    <name>Замещен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="ba85eb5c-9b6e-4b48-91c7-27de33dd2f16">
    <name>ВидДокументаНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="088d9db2-1a15-4bff-99d4-26bc08da07cd">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8d7e3dc7-96eb-4e67-9634-d1e75420b4bb">
    <name>IDРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="60e67476-1608-4996-b48f-ffa74f993732">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="332898fd-fb46-4e34-af0e-1450d855fac1">
    <name>ПодразделениеИнициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="442326ff-0b99-4a6d-81af-fa819b4a7b89">
    <name>ДокументНачалаЦепочки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/Enums/торо_СтатусыУтвержденияЗаказовНаВП/торо_СтатусыУтвержденияЗаказовНаВП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="db5b1609-65ac-42cf-9053-e0b79f8ef87b">
  <name>торо_СтатусыУтвержденияЗаказовНаВП</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="57e30e6c-f60b-42d5-8b2c-4c2b5007c40c">
    <name>проф_Новый</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7612b309-90e1-40b9-93d9-2a11e7f96bbf">
    <name>НаУтверждении</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Enums/торо_ВидыДокументовНачалаЦепочкиРемонтов/торо_ВидыДокументовНачалаЦепочкиРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9a4a271c-3df6-45ca-a18a-c3a215a23313">
  <name>торо_ВидыДокументовНачалаЦепочкиРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="567a12d3-c608-43f0-a336-d5f773d2a52a">
    <name>ВнешнееОснованиеДляРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="71d3ac2c-00e7-4f96-8907-382131bb091a">
    <name>ВыявленныйДефект</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="567318ad-fa36-4a40-8027-655e8c8f1c0b">
    <name>ПланГрафикППР</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="dddfb2af-bfea-4ecb-bce9-f89ad241fcdb">
    <name>ГрафикРегламентныхМероприятий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/toir_cfe/src/Documents/торо_НарядНаВыполнениеРемонтныхРабот/торо_НарядНаВыполнениеРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="91a3657a-5af9-486c-bdd1-67ccd3de7fce">
  <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="f70fd13e-81a3-43b3-9a2a-08cc80f978c7">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5e090819-3bf8-4a64-a7d2-0ab585ce4316">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Documents/торо_ЗаявкаНаРемонт/торо_ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="145aacdb-f868-47fa-a11a-64c1ee401e0c">
  <name>торо_ЗаявкаНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0897f476-6166-46f5-b06b-269173e4520e">
    <name>проф_СтатусСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="03e32b56-c47c-4bc5-93ac-0da2e38d3c38">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8e0e-2544-4812-8554-4a3ee2dc14b2">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ed39b61-bbcb-4d6e-853d-79611e8e5aff">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f6af02a-4b40-4613-8cc7-8b4a64e0e244">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ccc4499d-64f9-48a4-98c6-612249fc206f">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="45912545-c381-435b-9239-8860ec2db3af">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/CommonModules/торо_ЗаполнениеДокументов20/Module.bsl
&ИзменениеИКонтроль("ЗаполнитьШапкуДокумента")
Процедура проф_ЗаполнитьШапкуДокумента(Основание, ДокументОбъект)

	ДокОснование = Неопределено;

	Если ТипЗнч(Основание) = Тип("Соответствие") Тогда
		Для каждого ДокОснование Из Основание Цикл
			ДокументОбъект.Организация = ДокОснование.Значение.Организация;
			ДокументОбъект.Подразделение = ДокОснование.Значение.Подразделение;	
			Прервать;
		КонецЦикла; 
	ИначеЕсли Основание <> Неопределено И НЕ ТипЗнч(Основание) = Тип("Структура") Тогда 
		ДокументОбъект.Организация = Основание.Организация;
		ДокументОбъект.Подразделение = Основание.Подразделение;
		ДокОснование = Основание;
	КонецЕсли;

	Если (ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктПриемкиОборудования") 
		ИЛИ ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")
		ИЛИ ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АнализКоренныхПричин")
		ИЛИ ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия"))
		И (ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") 
		ИЛИ ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот")
		ИЛИ ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")
		ИЛИ ТипЗнч(ДокОснование) = Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие")) Тогда
		ДокументОбъект.Комиссия = ДокОснование.Комиссия;
	КонецЕсли;

	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АнализКоренныхПричин") Тогда

		ДокументОбъект.Статус = Перечисления.торо_СтатусыДокументовАнализаПричин.Зарегистрирован;

	КонецЕсли; 

	
	#Вставка
	//++ Проф-ИТ, #238, Башинская А.Ю., 28.08.2023 	
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") 
	И Не ЗначениеЗаполнено(ДокументОбъект.проф_СтатусСогласования) Тогда  
		ДокументОбъект.проф_СтатусСогласования = Перечисления.торо_СтатусыУтвержденияЗаказовНаВП.проф_Новый;
	КонецЕсли; 	
	#КонецВставки
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ДокументОбъект);

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьРемонтыОборудования")
Процедура проф_ЗаполнитьРемонтыОборудования(Основание, ДокументОбъект, Параметры)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	#Область ТекстЗапроса	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ТабДокументовОснований.Ключ КАК ID,
	|	ВТ_ТабДокументовОснований.Значение КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ТабДокументовОснований
	|ИЗ
	|	&ТаблицаДокументовОснований КАК ВТ_ТабДокументовОснований
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта КАК ID,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаНачала КАК ДатаНачала,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДатаОкончания КАК ДатаОкончания,
	|	торо_АктуальныеПлановыеДатыРемонтов.КрайняяДатаЗавершения КАК КрайняяДатаЗавершения,
	|	ВТ_ТабДокументовОснований.Ссылка КАК Ссылка,
	|	торо_АктуальныеПлановыеДатыРемонтов.ДокументНачалаЦепочки КАК ДокументНачалаЦепочки,
	|	торо_ОбщиеДанныеПоРемонтам.ОбъектРемонта КАК ОбъектРемонта,
	|	ВЫБОР
	|		КОГДА НЕ торо_ОбщиеДанныеПоРемонтам.ВидРемонта = ЗНАЧЕНИЕ(Справочник.торо_ВидыРемонтов.ПустаяСсылка)
	|			ТОГДА торо_ОбщиеДанныеПоРемонтам.ВидРемонта
	|		КОГДА торо_ОбщиеДанныеПоРемонтам.ВидДокументаНачалаЦепочки = ЗНАЧЕНИЕ(Перечисление.торо_ВидыДокументовНачалаЦепочкиРемонтов.ВыявленныйДефект)
	|			ТОГДА &ВидРемонтаНаОснованииВыявленныхДефектов
	|		ИНАЧЕ &ВидРемонтаНаОснованииВнешнихОснований
	|	КОНЕЦ КАК ВидРемонтныхРабот,
	|	торо_ОбщиеДанныеПоРемонтам.Завершен КАК Завершен
	|ПОМЕСТИТЬ ТаблицаПлановыхДат
	|ИЗ
	|	ВТ_ТабДокументовОснований КАК ВТ_ТабДокументовОснований
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_АктуальныеПлановыеДатыРемонтов КАК торо_АктуальныеПлановыеДатыРемонтов
	|		ПО ВТ_ТабДокументовОснований.ID = торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОбщиеДанныеПоРемонтам КАК торо_ОбщиеДанныеПоРемонтам
	|		ПО ВТ_ТабДокументовОснований.ID = торо_ОбщиеДанныеПоРемонтам.IDРемонта
	|ГДЕ
	|	НЕ торо_ОбщиеДанныеПоРемонтам.Отменен
	|	И НЕ торо_ОбщиеДанныеПоРемонтам.Замещен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	торо_АктуальныеПлановыеДатыРемонтов.IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЗаявкиПоРемонтам.IDРемонта КАК IDРемонта
	|ПОМЕСТИТЬ ВТ_ЗаявкиПоРемонту
	|ИЗ
	|	РегистрСведений.торо_ЗаявкиПоРемонтам.СрезПоследних(
	|			,
	|			IDРемонта В
	|				(ВЫБРАТЬ
	|					ВТ_ТабДокументовОснований.ID
	|				ИЗ
	|					ВТ_ТабДокументовОснований КАК ВТ_ТабДокументовОснований)) КАК торо_ЗаявкиПоРемонтам
	|ГДЕ
	|	НЕ торо_ЗаявкиПоРемонтам.Отменен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ЗаявкиПоРемонтам.IDРемонта КАК IDРемонта
	|ПОМЕСТИТЬ ВТ_ОтмененнаяЗаявкаОснование
	|ИЗ
	|	РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТабДокументовОснований КАК ВТ_ТабДокументовОснований
	|		ПО торо_ЗаявкиПоРемонтам.ДокументЗаявка = ВТ_ТабДокументовОснований.Ссылка
	|			И торо_ЗаявкиПоРемонтам.IDРемонта = ВТ_ТабДокументовОснований.ID
	|ГДЕ
	|	торо_ЗаявкиПоРемонтам.Отменен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	IDРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаПлановыхДат.ID КАК ID,
	|	ТаблицаПлановыхДат.Ссылка КАК ДокументИсточник,
	|	ТаблицаПлановыхДат.Ссылка КАК ДокументОснование,
	|	ТаблицаПлановыхДат.ОбъектРемонта КАК ОбъектРемонта,
	|	ТаблицаПлановыхДат.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ЕСТЬNULL(торо_СвернутыеФактическиеДатыРемонтов.ДатаНачала, ТаблицаПлановыхДат.ДатаНачала) КАК ДатаНачала,
	|	ЕСТЬNULL(торо_СвернутыеФактическиеДатыРемонтов.ДатаОкончания, ТаблицаПлановыхДат.ДатаОкончания) КАК ДатаОкончания,
	|	ТаблицаПлановыхДат.КрайняяДатаЗавершения КАК КрайняяДопустимаяДатаЗавершенияРемонта,
	|	торо_ГарантийностьРемонтов.Гарантийный КАК ГарантийныйРемонт,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение, ЕСТЬNULL(торо_ВнешниеОснования.Описание, """")) КАК СТРОКА(1000)) КАК ОписаниеРемонта,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранениеЯзык1, ЕСТЬNULL(торо_ВнешниеОснования.ОписаниеЯзык1, """")) КАК СТРОКА(1000)) КАК ОписаниеРемонтаЯзык1,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранениеЯзык2, ЕСТЬNULL(торо_ВнешниеОснования.ОписаниеЯзык2, """")) КАК СТРОКА(1000)) КАК ОписаниеРемонтаЯзык2,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(торо_ВыявленныеДефектыСписокДефектов.Высота, ЕСТЬNULL(торо_ВнешниеОснования.Высота, 0)) КАК ЧИСЛО(20, 2)) КАК Высота,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(торо_ВыявленныеДефектыСписокДефектов.Долгота, ЕСТЬNULL(торо_ВнешниеОснования.Долгота, 0)) КАК ЧИСЛО(20, 14)) КАК Долгота,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(торо_ВыявленныеДефектыСписокДефектов.Широта, ЕСТЬNULL(торо_ВнешниеОснования.Широта, 0)) КАК ЧИСЛО(20, 14)) КАК Широта,
	|	торо_ВыявленныеДефектыСписокДефектов.КритичностьДефекта КАК КритичностьДефекта,      
	#Вставка
	//++ Проф-ИТ, #266, Башинская А.Ю., 25.09.2023 
	|	торо_ВидыДефектов.проф_ВидРемонта КАК проф_ВидРемонта,	
	#КонецВставки
	|	ТаблицаПлановыхДат.Завершен КАК Завершен,
	|	торо_ОстановочныеРемонты.IDОсновного КАК IDОсновного
	|ИЗ
	|	ТаблицаПлановыхДат КАК ТаблицаПлановыхДат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_СвернутыеФактическиеДатыРемонтов КАК торо_СвернутыеФактическиеДатыРемонтов
	|		ПО ТаблицаПлановыхДат.ID = торо_СвернутыеФактическиеДатыРемонтов.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефектыСписокДефектов
	|		ПО ТаблицаПлановыхДат.ID = торо_ВыявленныеДефектыСписокДефектов.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВнешниеОснованияДляРабот КАК торо_ВнешниеОснования
	|		ПО ТаблицаПлановыхДат.ID = торо_ВнешниеОснования.ID
	|			И ТаблицаПлановыхДат.Ссылка = торо_ВнешниеОснования.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОстановочныеРемонты КАК торо_ОстановочныеРемонты
	|		ПО ТаблицаПлановыхДат.ID = торо_ОстановочныеРемонты.IDЗависимого
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаявкиПоРемонту КАК ВТ_ЗаявкиПоРемонту
	|		ПО ТаблицаПлановыхДат.ID = ВТ_ЗаявкиПоРемонту.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтмененнаяЗаявкаОснование КАК ВТ_ОтмененнаяЗаявкаОснование
	|		ПО ТаблицаПлановыхДат.ID = ВТ_ОтмененнаяЗаявкаОснование.IDРемонта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ГарантийностьРемонтов.СрезПоследних КАК торо_ГарантийностьРемонтов
	|		ПО ТаблицаПлановыхДат.ID = торо_ГарантийностьРемонтов.IDРемонта  
	#Вставка      
	//++ Проф-ИТ, #266, Башинская А.Ю., 25.09.2023 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ВидыДефектов КАК торо_ВидыДефектов
	|		ПО торо_ВыявленныеДефектыСписокДефектов.ВидДефекта = торо_ВидыДефектов.ссылка  
	#КонецВставки
	|ГДЕ
	|	ВТ_ОтмененнаяЗаявкаОснование.IDРемонта ЕСТЬ NULL
	|	И (&ВводНесколькихЗаявокПоРемонту
	|			ИЛИ ВТ_ЗаявкиПоРемонту.IDРемонта ЕСТЬ NULL)
	|	И (НЕ &ОтборПоОрганизацииИПодразделению
	|			ИЛИ ТаблицаПлановыхДат.ОбъектРемонта.Организация = &Организация
	|				И ТаблицаПлановыхДат.ОбъектРемонта.Подразделение = &Подразделение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала,
	|	ОбъектРемонта";

	#КонецОбласти

	Если Параметры <> Неопределено И Параметры.Свойство("ОрганизацияДляОтбора") И Параметры.Свойство("ПодразделениеДляОтбора") Тогда
		Запрос.УстановитьПараметр("ОтборПоОрганизацииИПодразделению", Истина);
		Запрос.УстановитьПараметр("Организация", Параметры.ОрганизацияДляОтбора);
		Запрос.УстановитьПараметр("Подразделение", Параметры.ПодразделениеДляОтбора);
	Иначе	
		Запрос.УстановитьПараметр("ОтборПоОрганизацииИПодразделению", Ложь);
		Запрос.УстановитьПараметр("Организация", Неопределено);
		Запрос.УстановитьПараметр("Подразделение", Неопределено);
	КонецЕсли; 

	ВводНесколькихЗаявокПоРемонту = Константы.торо_РазрешитьВводНесколькихСметПоРемонту.Получить();
	Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") И Не ВводНесколькихЗаявокПоРемонту Тогда
		Запрос.УстановитьПараметр("ВводНесколькихЗаявокПоРемонту", Ложь);
	Иначе
		Запрос.УстановитьПараметр("ВводНесколькихЗаявокПоРемонту", Истина);
	КонецЕсли;

	Запрос.УстановитьПараметр("ТаблицаДокументовОснований", ПолучитьТаблицуДокументовОснований(Основание));	
	Запрос.УстановитьПараметр("ВидРемонтаНаОснованииВыявленныхДефектов", Константы.торо_ВидРемонтаПриВводеНаОснованииВыявленныхДефектов.Получить());
	Запрос.УстановитьПараметр("ВидРемонтаНаОснованииВнешнихОснований", Константы.торо_ВидРемонтаПриВводеНаОснованииВнешнихОснований.Получить());

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ИмяТЧРемонтов = торо_Ремонты.ПолучитьИмяТЧРемонтов(ДокументОбъект.Ссылка);

	Попытка
		ТаблицаРемонтов = ДокументОбъект[ИмяТЧРемонтов];
	Исключение
		// Сюда может попасть из обработки подбора ремонтов. Запись в ЖР не требуется.
		ТаблицаРемонтов = ДокументОбъект["РемонтыОборудования"];
	КонецПопытки;

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаРемонтов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.торо_АктОВыполненииЭтапаРабот") Тогда
			НоваяСтрока.ИДДефекта = Выборка.ID;
		КонецЕсли;   
		#Вставка      
		//++ Проф-ИТ, #266, Башинская А.Ю., 25.09.2023 
		Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт")
		И ТипЗнч(Выборка.ДокументОснование) = Тип("ДокументСсылка.торо_ВыявленныеДефекты") 
		И ЗначениеЗаполнено(Выборка.проф_ВидРемонта) Тогда
			НоваяСтрока.ВидРемонтныхРабот = Выборка.проф_ВидРемонта;
		КонецЕсли;  
		#КонецВставки
	КонецЦикла;
	
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьЗатратыПоОснованию")
Процедура проф_ЗаполнитьЗатратыПоОснованию(ДокументОбъект, Основания)

	// TODO: заполнять только для одной ремонтной работы

	Если ТипЗнч(ДокументОбъект.Ссылка) <> Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")
		И ТипЗнч(ДокументОбъект.Ссылка) <> Тип("ДокументСсылка.торо_АктОВыполненииРегламентногоМероприятия")
		И ТипЗнч(ДокументОбъект.Ссылка) <> Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот") 
		И ТипЗнч(ДокументОбъект.Ссылка) <> Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие")
		И ТипЗнч(ДокументОбъект.Ссылка) <> Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		Возврат;
	КонецЕсли;

	СоответствиеИсполнителейПоОснованию = Новый Соответствие;
	СоответствиеИсполнителейПоНормам = Новый Соответствие;
	СоответствиеМатериаловПоОснованию = Новый Соответствие;
	СоответствиеМатериаловПоНормам = Новый Соответствие;

	ТаблицаДанныхОЦепочках = ПолучитьТаблицуИнформацииОЦепочкеРемонтов(Основания);

	Для каждого СтрокаДанныхЦепочки из ТаблицаДанныхОЦепочках Цикл
		Если ЗначениеЗаполнено(СтрокаДанныхЦепочки.Наряд) ИЛИ ЗначениеЗаполнено(СтрокаДанныхЦепочки.Заявка) Тогда 
			СоответствиеИсполнителейПоОснованию.Вставить(СтрокаДанныхЦепочки.ID, СтрокаДанныхЦепочки.ДокументОснование);
		Иначе
			СоответствиеИсполнителейПоНормам.Вставить(СтрокаДанныхЦепочки.ID, СтрокаДанныхЦепочки.ДокументОснование);
		КонецЕсли;

		Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот")
			И ЗначениеЗаполнено(СтрокаДанныхЦепочки.Наряд) И ЗначениеЗаполнено(СтрокаДанныхЦепочки.Заявка) Тогда
			#Удаление //++ Проф-ИТ, #365, Соловьев А.А., 21.11.2023
			СоответствиеМатериаловПоОснованию.Вставить(СтрокаДанныхЦепочки.ID, СтрокаДанныхЦепочки.ДокументОснование);
			#КонецУдаления
			#Вставка
			СоответствиеМатериаловПоОснованию.Вставить(СтрокаДанныхЦепочки.ID, СтрокаДанныхЦепочки.Заявка);
			#КонецВставки //-- Проф-ИТ, #365, Соловьев А.А., 21.11.2023
			СоответствиеМатериаловПоНормам.Вставить(СтрокаДанныхЦепочки.ID, СтрокаДанныхЦепочки.ДокументОснование);
		Иначе
			Если ЗначениеЗаполнено(СтрокаДанныхЦепочки.Заявка) Тогда
				#Удаление //++ Проф-ИТ, #365, Соловьев А.А., 21.11.2023
				СоответствиеМатериаловПоОснованию.Вставить(СтрокаДанныхЦепочки.ID, СтрокаДанныхЦепочки.ДокументОснование);
				#КонецУдаления
				#Вставка
				СоответствиеМатериаловПоОснованию.Вставить(СтрокаДанныхЦепочки.ID, СтрокаДанныхЦепочки.Заявка);
				#КонецВставки //-- Проф-ИТ, #365, Соловьев А.А., 21.11.2023
			Иначе
				СоответствиеМатериаловПоНормам.Вставить(СтрокаДанныхЦепочки.ID, СтрокаДанныхЦепочки.ДокументОснование);
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;

	ЗаполнитьЗатратыПоОснованию_Исполнители(ДокументОбъект, СоответствиеИсполнителейПоОснованию, СоответствиеИсполнителейПоНормам);
	ЗаполнитьЗатратыПоОснованию_Материалы(ДокументОбъект, СоответствиеМатериаловПоОснованию, СоответствиеМатериаловПоНормам);
	ЗаполнитьЗатратыПоОснованию_ЗапчастиПодрядчики(ДокументОбъект, Основания);
	ЗаполнитьЗатратыПоОснованию_ИнструментыМерыБезопасности(ДокументОбъект, Основания)

КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьТаблицуИнформацииОЦепочкеРемонтов")
Функция проф_ПолучитьТаблицуИнформацииОЦепочкеРемонтов(СоответствиеОснований)

	// Для заполнения затрат по основаниям или нормативам нас инетерсует: 
	// - есть ли в цепочке документов наряд (для заполнения исполнителей);
	// - естьли в цепочке документов заявка (для заполнения исполнителей и материальных затрат).
	// С чего цепочка началась - по большому счету не важно. Если нет ни заявки, ни наряда, 
	// то должно выполниться заполнения по нормам. Поэтому рассматриваем только описанные случаи.

	МассивТиповДокументовИсточников = Новый Массив;
	МассивТиповДокументовИсточников.Добавить(Тип("ДокументСсылка.торо_ВыявленныеДефекты"));
	МассивТиповДокументовИсточников.Добавить(Тип("ДокументСсылка.торо_ВнешнееОснованиеДляРабот"));
	МассивТиповДокументовИсточников.Добавить(Тип("ДокументСсылка.торо_ПланГрафикРемонта"));
	МассивТиповДокументовИсточников.Добавить(Тип("ДокументСсылка.торо_ЗаявкаНаРемонт"));
	МассивТиповДокументовИсточников.Добавить(Тип("ДокументСсылка.торо_НарядНаВыполнениеРемонтныхРабот"));
	МассивТиповДокументовИсточников.Добавить(Тип("ДокументСсылка.торо_ГрафикРегламентныхМероприятийТОиР"));
	МассивТиповДокументовИсточников.Добавить(Тип("ДокументСсылка.торо_НарядНаРегламентноеМероприятие"));

	ТаблицаРемонтов = Новый ТаблицаЗначений();
	ТаблицаРемонтов.Колонки.Добавить("ID", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	ТаблицаРемонтов.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов(МассивТиповДокументовИсточников));

	Для каждого КлючИЗначение из СоответствиеОснований Цикл
		НоваяСтрока = ТаблицаРемонтов.Добавить();
		НоваяСтрока.ID = КлючИЗначение.Ключ;
		НоваяСтрока.ДокументОснование = КлючИЗначение.Значение;
	КонецЦикла;

	// При заполнении затрат на основании наряд в цепочке может быть только в том случае, если 
	// сам документ-основание является нарядом. Заявка в цепочке может быть, если сам докумен-основание
	// является заявкой, либо если документ-основание является нарядом, созданным на основании заявки.

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаРемонтов.ID КАК ID,
	|	ТаблицаРемонтов.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ТаблицаРемонтов
	|ИЗ
	|	&ТаблицаРемонтов КАК ТаблицаРемонтов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРемонтов.ID КАК ID,
	|	ТаблицаРемонтов.ДокументОснование КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА ТаблицаРемонтов.ДокументОснование ССЫЛКА Документ.торо_НарядНаВыполнениеРемонтныхРабот
	|				ИЛИ ТаблицаРемонтов.ДокументОснование ССЫЛКА Документ.торо_НарядНаРегламентноеМероприятие
	|			ТОГДА ТаблицаРемонтов.ДокументОснование
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Наряд
	|ПОМЕСТИТЬ ТаблицаСНарядами
	|ИЗ
	|	ТаблицаРемонтов КАК ТаблицаРемонтов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Наряд,
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаСНарядами.ID КАК ID,
	|	ТаблицаСНарядами.ДокументОснование КАК ДокументОснование,
	|	ТаблицаСНарядами.Наряд КАК Наряд,
	|	ВЫБОР
	|		КОГДА ТаблицаСНарядами.ДокументОснование ССЫЛКА Документ.торо_ЗаявкаНаРемонт
	|			ТОГДА ТаблицаСНарядами.ДокументОснование
	|		КОГДА НЕ торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДокументИсточник ЕСТЬ NULL
	|				И торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДокументИсточник ССЫЛКА Документ.торо_ЗаявкаНаРемонт
	|			ТОГДА торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ДокументИсточник
	#Вставка //++ Проф-ИТ, #365, Соловьев А.А., 21.11.2023
	|		КОГДА торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.ДокументОснование ССЫЛКА Документ.торо_ЗаявкаНаРемонт
	|			ТОГДА торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.ДокументОснование
	#КонецВставки //-- Проф-ИТ, #365, Соловьев А.А., 21.11.2023
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Заявка
	|ИЗ
	|	ТаблицаСНарядами КАК ТаблицаСНарядами
	#Вставка //++ Проф-ИТ, #365, Соловьев А.А., 21.11.2023
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.ДокументыОснования КАК торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования
	|		ПО ТаблицаСНарядами.Наряд = торо_НарядНаВыполнениеРемонтныхРаботДокументыОснования.Ссылка
	#КонецВставки //-- Проф-ИТ, #365, Соловьев А.А., 21.11.2023
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_НарядНаВыполнениеРемонтныхРабот.РемонтыОборудования КАК торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования
	|		ПО ТаблицаСНарядами.Наряд = торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.Ссылка
	|			И ТаблицаСНарядами.ID = торо_НарядНаВыполнениеРемонтныхРаботРемонтыОборудования.ID";

	Запрос.УстановитьПараметр("ТаблицаРемонтов", ТаблицаРемонтов);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;

КонецФункции
